# DataFrame Introduction

### Import Pandas

In [1]:
import pandas as pd

### U.S. Major League Soccer Salaries 
The dataset we will be using int this video is `mls_salaries.csv` which is a modified dataset from [Kaggle](https://www.kaggle.com/crawford/us-major-league-soccer-salaries) focusing on 2017 US Major League Soccer salary data. You should use the modified dataset provided in this course if you want follow along with the video. Let's get started!

In [5]:
mls_salary = pd.read_csv("mls_salaries.csv")

### DataFrame

In [6]:
mls_salary.head(10)

,club,last_name,first_name,position,base_salary,guaranteed_compensation
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00
1,ATL,Ambrose,Mikey,D,65625.0,65625.00
2,ATL,Asad,Yamil,M,150000.0,150000.00
3,ATL,Bloom,Mark,D,99225.0,106573.89
4,ATL,Carleton,Andrew,F,65000.0,77400.00
5,ATL,Carmona,Carlos,M,675000.0,725000.00
6,ATL,Garza,Greg,D,150000.0,150000.00
7,ATL,Gonzalez Pirez,Leandro,D,250008.0,285008.00
8,ATL,Goslin,Chris,M,70000.0,74000.00
9,ATL,Gressel,Julian,NaN,75000.0,93750.00

### NaN Values

In [7]:
mls_salary.tail()

    club last_name first_name position  base_salary  guaranteed_compensation
610  VAN   Teibert    Russell        M     126500.0                 194000.0
611  VAN  Tornaghi      Paolo       GK      80000.0                  80000.0
612  VAN    Waston    Kendall        D     350000.0                 368125.0
613  NaN       NaN        NaN      NaN          NaN                      NaN
614  VAN  Williams    Sheanon        D     175000.0                 184000.0